In [20]:
import pandas as pd

In [1]:
from cassandra.cluster import Cluster
cluster = Cluster()
session = cluster.connect()

In [2]:
# display all keyspaces
rs=session.execute("select * from system_schema.keyspaces")
for row in rs.all():
    print("keyspace name : ", row[0])
    print("replication Details : ",row[2])

keyspace name :  system_auth
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '1'}
keyspace name :  system_schema
replication Details :  {'class': 'org.apache.cassandra.locator.LocalStrategy'}
keyspace name :  system_distributed
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '3'}
keyspace name :  system
replication Details :  {'class': 'org.apache.cassandra.locator.LocalStrategy'}
keyspace name :  tp
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '3'}
keyspace name :  system_traces
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '2'}

In [3]:
# create keyspaces
session.execute("CREATE KEYSPACE IF NOT EXISTS tp WITH replication = {'class':'SimpleStrategy', 'replication_factor':1}").one()
rs=session.execute("select * from system_schema.keyspaces")
for row in rs.all():
    print("keyspace name : ", row[0])
    print("replication Details : ",row[2])

keyspace name :  system_auth
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '1'}
keyspace name :  system_schema
replication Details :  {'class': 'org.apache.cassandra.locator.LocalStrategy'}
keyspace name :  system_distributed
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '3'}
keyspace name :  system
replication Details :  {'class': 'org.apache.cassandra.locator.LocalStrategy'}
keyspace name :  tp
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '3'}
keyspace name :  system_traces
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '2'}

In [4]:
session.execute("ALTER KEYSPACE tp WITH replication = {'class':'SimpleStrategy', 'replication_factor':3}")
rs=session.execute("select * from system_schema.keyspaces")
for row in rs.all():
    print("keyspace name : ", row[0])
    print("replication Details : ",row[2])

keyspace name :  system_auth
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '1'}
keyspace name :  system_schema
replication Details :  {'class': 'org.apache.cassandra.locator.LocalStrategy'}
keyspace name :  system_distributed
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '3'}
keyspace name :  system
replication Details :  {'class': 'org.apache.cassandra.locator.LocalStrategy'}
keyspace name :  tp
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '3'}
keyspace name :  system_traces
replication Details :  {'class': 'org.apache.cassandra.locator.SimpleStrategy', 'replication_factor': '2'}

In [ ]:
session.execute("DROP KEYSPACE tp")

In [7]:
# Create table
session.execute("use tp")
session.execute("CREATE TABLE student(student_id int PRIMARY KEY,student_name text,student_city text,student_fee varint,student_phone varint)")

In [8]:
session.execute("ALTER table student add student_email text")

In [9]:
session.execute("ALTER table student drop student_email")

In [11]:
session.execute("ALTER TABLE student DROP (student_fee, student_phone)")

In [12]:
session.execute("drop table student")

In [14]:
session.execute("DESCRIBE COLUMNFAMILIES")

SyntaxException: <Error from server: code=2000 [Syntax error in CQL query] message="line 1:0 no viable alternative at input 'DESCRIBE' ([DESCRIBE]...)">

In [16]:
session.execute("CREATE TABLE student(student_id int PRIMARY KEY,student_fees varint,student_name text)")

In [17]:
session.execute("INSERT INTO student (student_id, student_fees, student_name) VALUES(1,5000, 'Ajeet')")
session.execute("INSERT INTO student (student_id, student_fees, student_name) VALUES(2,3000, 'Kanchan')")
session.execute("INSERT INTO student (student_id, student_fees, student_name) VALUES(3, 2000, 'Shivani')")
session.execute("INSERT INTO student (student_id, student_fees, student_name) VALUES(4, 2000, 'Manidhar')")

In [21]:
rs = session.execute("select * from student")
rows=pd.DataFrame(rs.all(),columns=['student_id','student_fees','student_name'])

In [22]:
rows.head()

   student_id  student_fees student_name
0           1          5000        Ajeet
1           2          3000      Kanchan
2           3          2000      Shivani

In [23]:
session.execute("UPDATE student SET student_fees=10000,student_name='Rahul' WHERE student_id=2")
rs = session.execute("select * from student where student_id=2")
rows=pd.DataFrame(rs.all(),columns=['student_id','student_fees','student_name'])
rows.head()

   student_id  student_fees student_name
0           2         10000        Rahul

In [25]:
session.execute("delete from student where student_id=4")
rs=session.execute("select * from student")
rows=pd.DataFrame(rs.all(),columns=['student_id','student_fees','student_name'])
rows.head()

# Delete sepecific column in table

In [27]:
session.execute("delete student_fees from student where student_id=3")
rs=session.execute("select * from student")
rows=pd.DataFrame(rs.all(),columns=['student_id','student_fees','student_name'])
rows.head()

   student_id  student_fees student_name
0           1        5000.0        Ajeet
1           2       10000.0        Rahul
2           3           NaN      Shivani

# Set Collection

In [28]:
session.execute("Create table employee(id int,Name text,Email set<text>,Primary key(id))")

In [29]:
session.execute("INSERT INTO employee (id, email, name) VALUES(1, {'ajeetraj4u@gmail.com'}, 'Ajeet')")
session.execute("INSERT INTO employee (id, email, name) VALUES(2,{'kanchan@gmail.com'}, 'Kanchan')")
session.execute("INSERT INTO employee (id, email, name) VALUES(3, {'kunwar4u@gmail.com'}, 'Kunwar')")
rs=session.execute("select * from employee")
rows=pd.DataFrame(rs.all(),columns=['id','email','name'])
rows.head()

   id                   email     name
0   1  (ajeetraj4u@gmail.com)    Ajeet
1   2     (kanchan@gmail.com)  Kanchan
2   3    (kunwar4u@gmail.com)   Kunwar

In [30]:
session.execute("alter table employee add department list<text>")

In [33]:
session.execute("insert into employee (id,email,name,department) values (4,{'manidhar@gmail.com'},'Manidhar',['IT','Development']) ")

In [36]:
rs=session.execute("select * from employee")
rows=pd.DataFrame(rs.all())
rows.head()

   id         department                   email      name
0   1               None  (ajeetraj4u@gmail.com)     Ajeet
1   2               None     (kanchan@gmail.com)   Kanchan
2   4  [IT, Development]    (manidhar@gmail.com)  Manidhar
3   3               None    (kunwar4u@gmail.com)    Kunwar